Revit 2027 API
TextNode.IsTransparent Property
 Indicates whether the text background is transparent or opaque.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsTransparent { get; }
Public ReadOnly Property IsTransparent As Boolean
	Get
public:
property bool IsTransparent {
	bool get ();
}
member IsTransparent : bool with get
Property Value
Boolean
See Also
Reference
TextNode Class
Autodesk.Revit.DB Namespace